# Практическое задание
# 1: Даны два произвольные списка.
# Удалите из первого списка элементы присутствующие во втором списке.
# Примечание. Списки создайте вручную, например так:
# my_list_1 = [2, 5, 8, 2, 12, 12, 4]
# my_list_2 = [2, 7, 12, 3]
# 2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача — вывести дату в текстовом виде, например:
# второе ноября 2013 года. Склонением пренебречь (2000 года, 2010 года)
# 3: Дан список заполненный произвольными целыми числами.
# Получите новый список,
# элементами которого будут только уникальные элементы исходного.
# Примечание. Списки создайте вручную, например так:
# my_list_1 = [2, 2, 5, 12, 8, 2, 12]
# В этом случае ответ будет:
# [5, 8]

print('Task_1. Lists')
print('------------||------------')
print()
my_list_1 = [13, 5, 13, 8, 2, 13, 13, 4, 6]
my_list_2 = [2, 7, 13, 3]
my_list_3 = []
my_list_4 = []
i = int(input('Input the number of elements in massive 1: '))
j = int(input('Input the number of elements in massive 2: '))
# values for 1st list
while i > 0:
    item = int(input('Number: '))
    my_list_3.append(item)
    i -=1
print(my_list_3)
# values for 2nd list
while j > 0:
    item = int(input('Number: '))
    my_list_4.append(item)
    j -= 1
print(my_list_4)
print()
# actual work cycle
# for val in my_list_1[:]:
#     if val in my_list_2:
#         my_list_1.remove(val)
# print(my_list_1)
# фор не правільно работает так как значенія удаляются
# исправлено
int = len(my_list_4)
while int != 0:
    for val in my_list_4:
        if val in my_list_3:
            my_list_3.remove(val)
    int -= 1
print(my_list_3)
print()


print('Task_2. Lists')
print('------------||------------')
print()
months = {
    "01": "январь",
    "02": "февраля",
    "03": "март",
    "04": "апрель",
    "05": "май",
    "06": "июнь",
    "07": "июль",
    "08": "август",
    "09": "сентябрь",
    "10": "октябрь",
    "11": "ноябрь",
    "12": "декабрь",
    "1": "январь",
    "2": "февраля",
    "3": "март",
    "4": "апрель",
    "5": "май",
    "6": "июнь",
    "7": "июль",
    "8": "август",
    "9": "сентябрь"
}
days = {
    "1": "Первое",
    "2": "Второе",
    "3": "Третье",
    "4": "Четвертое",
    "5": "Пятое",
    "6": "Шестое",
    "7": "Седьмое",
    "8": "Восьмое",
    "9": "Девятое",
    "01": "Первое",
    "02": "Второе",
    "03": "Третье",
    "04": "Четвертое",
    "05": "Пятое",
    "06": "Шестое",
    "07": "Седьмое",
    "08": "Восьмое",
    "09": "Девятое",
    "10": "Десятое",
    "11": "Одиннадцатое",
    "12": "Двенадцатое",
    "13": "Тринадцатое",
    "14": "Четырнадцатое",
    "15": "Пятнадцатое",
    "16": "Шестнадцатое",
    "17": "Семнадцатое",
    "18": "Восемнадцатое",
    "19": "Девятнадцатое",
    "20": "Двадцатое",
    "21": "Двадцать первое",
    "22": "Двадцать второе",
    "23": "Двадцать третье",
    "24": "Двадцать четвертое",
    "25": "Двадцать пятое",
    "26": "Двадцать шестое",
    "27": "Двадцать седьмое",
    "28": "Двадцать восьмое",
    "29": "Двадцать девятое",
    "30": "Тридцатое",
    "31": "Тридцать первое",
}
# 2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача — вывести дату в текстовом виде, например:
# второе ноября 2013 года. Склонением пренебречь (2000 года, 2010 года)
date = input('Enter Date: ')
split_date = date.split('.')
print(split_date)
print(type(split_date))
while int(split_date[0]) > 31 or int(split_date[1]) > 12 or len(split_date) != 3:
    print('Invalid date, dude!')
    date = input('Enter Date: ')
    split_date = date.split('.')
    print(split_date)
result_str = 'Date: {} {} {} года'.format(days[split_date[0]], months[split_date[1]], split_date[2])
print(result_str)
print()


print('Task_3. Lists')
print('------------||------------')
print()
# 3: Дан список заполненный произвольными целыми числами.
# Получите новый список,
# элементами которого будут только уникальные элементы исходного.
# Примечание. Списки создайте вручную, например так:
# my_list_1 = [2, 2, 5, 12, 8, 2, 12]
# В этом случае ответ будет:
# [5, 8]
my_list_new = []
lenght = int(input('Input the number of elements in list: '))
while lenght > 0:
    my_list_new.append(int(input('Number: ')))
    lenght -= 1
print('List created: ', my_list_new)
fixed_list = list(set(my_list_new))
print('Fixed list: ', fixed_list)
print()

# from lesson
# numbers = [1,1,2,3,3,4,4,4,5,1,2,7]
# result = []
# for number in numbers:
#     if numbers.count(number) == 1:
#         result.append(number)
# print(result)
